InformationRegisters/ПраваПользователейГруппСообщений_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПраваПользователейГруппСообщений_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Администрирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСообщений_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСГруппамиСообщений_ат/Ext/Module.bsl
// Функция возвращает список доступных пользователю групп сообщений
// Параметры:
// Пользователь - пользователь или группа пользователей для которых требуется получить список
// 
Функция ПолучитьДоступныеГруппыСообщений(Пользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПраваПользователейГруппСообщений_ат.ГруппаСообщений,
	|	ПраваПользователейГруппСообщений_ат.Администрирование,
	|	ПраваПользователейГруппСообщений_ат.Чтение,
	|	ПраваПользователейГруппСообщений_ат.Запись,
	|	ПраваПользователейГруппСообщений_ат.Уведомление
	|ИЗ
	|	РегистрСведений.ПраваПользователейГруппСообщений_ат КАК ПраваПользователейГруппСообщений_ат
	|ГДЕ
	|	ПраваПользователейГруппСообщений_ат.Пользователь = &Пользователь
	|	И ПраваПользователейГруппСообщений_ат.Чтение = ИСТИНА" ;
	
	запрос.УстановитьПараметр("Пользователь", Пользователь);
	ТаблицаГруппПользователей = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаГруппПользователей;
	
КонецФункции
